app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		#Ob tiene todos los rgistros de la tabla Articles..
		@articles = Article.all

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2016-04-16 20:07:47.430705"], ["id", 13]]
---
	def show
		@article.update_visits_count

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "POST Nuevo"], ["body", "POST Nuevo"], ["created_at", "2016-04-08 05:18:39.297706"], ["updated_at", "2016-04-08 05:18:39.297706"]]
---
	def create
		#Este es el Insert into
		#Esta es la antigua ->
		#@article = Article.new(title: params[:article][:title], body: params[:article][:title])
		@article = current_user.articles.new(article_params)
		if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]
---
	def destroy
		#@article = Article.find(params[:id])
		@article.destroy

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "POST Nuevo jajajaja"], ["updated_at", "2016-04-12 00:22:28.788705"], ["id", 2]]
---
	def update
	  	#@article = Article.find(params[:id])
	  	if  @article.update(article_params)