app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 12], ["body", "Una maravilla los Scaffold de rails"], ["created_at", "2016-04-17 04:35:20.240779"], ["updated_at", "2016-04-17 04:35:20.240779"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "jola mundo que tal"], ["updated_at", "2016-04-17 04:36:48.844369"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)